Public Attributes | List of all members
API_PhotoRenderPars Struct Reference
Rendering Scenes and Settings
Parameters for saving photo rendered picture into an image file. More...
#include <APIdefs_Automate.h>
 Public Attributes
API_FTypeID  | fileTypeID
Image file format for saving the picture. Valid values are: APIFType_PictFile, APIFType_BMPFile, APIFType_TIFFFile, APIFType_JPEGFile and APIFType_GIFFile.
IO::Location *  | file
File specification for saving the picture.
API_ColorDepthID  | colorDepth
Color depth of the picture to be saved.
bool  | dithered
Use dithering when saving the picture.
Detailed Description
Parameters for saving photo rendered picture into an image file.
Remarks
The ACAPI_Rendering_PhotoRender automation function uses this structure.
Member Data Documentation
◆ colorDepth
 API_PhotoRenderPars::colorDepth
Color depth of the picture to be saved.
◆ dithered
 API_PhotoRenderPars::dithered
Use dithering when saving the picture.
◆ file
 API_PhotoRenderPars::file
File specification for saving the picture.
◆ fileTypeID
 API_PhotoRenderPars::fileTypeID
Image file format for saving the picture. Valid values are: APIFType_PictFile, APIFType_BMPFile, APIFType_TIFFFile, APIFType_JPEGFile and APIFType_GIFFile.